app.factory("CookBookService", function (){
	return {
		getCookBook: function () {
			return CookBook;
		}
		, addCookBook: function (recipe) {
			CookBook.push(recipe);
		}
	}
});
    
var CookBook = [
     {
            nameRecipe: "ЯЄЧНЯ СМАЖЕНА З ОВОЧАМИ",
            recipeContent: "Суміш, не розморожуючи, смажити на розігрітій олії 5—8 хв. посолити і приправити за смаком. На пательні в смажених овочах зробити 3 заглибини, вбити в них по одному яйцю і смажити ще 3—5 хв. на помірному вогні, не закриваючи кришкою. Страву подавати гарячою.",
            showRecipe: "false",
            dateCreated:"2018:03:12",
            historyOfChange: [{
                dateCreated:"2018:03:12",
                nameRecipe: "false",
                recipeContent: "Суміш, не розморожуючие закриваючи кришкою. Страву подавати гарячою."
                              
            },{
                dateCreated:"22222222",
                nameRecipe: "22222222222false",
                recipeContent: "Суміш, не розморожуючие закриваючи кришкою. Страву подавати гарячою."
            }]
		}
		, {
            nameRecipe: "ОПИС СТРАВИ",
            recipeContent: "Смачні, леши мільйони сердець у всьому світі, вони були і залишаються найбільш затребуваною стравою на нашому столі. Швидкість приготування та відсутність підігріву — ось дві основні переваги салатів, таких важливих при сьогоднішньому темпі життя. А чого ",
            showRecipe: "false",
            dateCreated:"2018:04:10",
            historyOfChange: [{
                dateCreated:"2018:03:12",
                nameRecipe: "false",
                recipeContent: "Суміш, не розморожуючие закриваючи кришкою. Страву подавати гарячою."                   }
            ]
		}
		, {
            nameRecipe: "САЛАТ ЗІ СМАЖЕНИМИ ШАМПІНЬЙОНАМИ",
            recipeContent: "Шампіньйони цінують за відмінні смакові якості та низьку калорійність. В 1 кг цих грибів міститься всього 400 ккал. Та чи знаєте Ви, що шампіньйони — гарний косметичний засіб, що покращує стан шкіри та бореться зі зморшками. ",
            showRecipe: "false",
            dateCreated:"2017:05:10",
            historyOfChange: []
		}
 , ];